app/Http/Controllers/DashboardController.php

    public function __invoke(): View
    {
        return view('dashboard', [
            'questions' => Question::query()
                ->withSum('votes', 'like')
                ->withSum('votes', 'unlike')
                ->orderByRaw('CASE WHEN votes_sum_like IS NULL THEN 0 ELSE votes_sum_like END DESC, CASE WHEN votes_sum_unlike IS NULL THEN 0 ELSE votes_sum_unlike END')
                ->paginate(5),
        ]);
---
select * from `questions`
select `questions`.*, (select sum(`votes`.`like`) from `votes` where `questions`.`id` = `votes`.`question_id`) as `votes_sum_like`, (select sum(`votes`.`unlike`) from `votes` where `questions`.`id` = `votes`.`question_id`) as `votes_sum_unlike` from `questions` limit 5 offset 0
select count(*) as aggregate from `questions`