app/Http/Controllers/QuestionController.php

insert into `questions` (`question`, `draft`, `created_by_id`, `updated_at`, `created_at`) values ('Nov a mensagem?', 1, 1, '2024-02-15 00:31:33', '2024-02-15 00:31:33')
---
                function (string $attribute, mixed $value, Closure $fail) {
                    if ($value[strlen($value) - 1] != '?') {
                        $fail("The {$attribute} is invalid.");
                    }
                },
            ],
        ]);

        user()->questions()->create([
            'question' => request()->question,
            'draft'    => true,
        ]);

delete from `questions` where `id` = 1
---
    public function destroy(Question $question): RedirectResponse
    {
        $this->authorize('destroy', $question);

        $question->delete();