app/Models/Question.php

select sum(`like`) as aggregate from `votes` where `votes`.`question_id` = 1 and `votes`.`question_id` is not null
select sum(`unlike`) as aggregate from `votes` where `votes`.`question_id` = 1 and `votes`.`question_id` is not null
---
    protected function likes(): Attribute
    {
        return new Attribute(get: fn () => $this->votes()->sum('like'));
    }    protected function unlikes(): Attribute
    {
        return new Attribute(get: fn () => $this->votes()->sum('unlike'));