app/Models/User.php

    public function like(Question $question): void
    {
        $this->votes()->updateOrCreate(
            ['question_id' => $question->id],
            [
                'like'   => 1,
                'unlike' => 0,
            ]
        );
    }    public function unlike(Question $question): void
    {
        $this->votes()->updateOrCreate(
            ['question_id' => $question->id],
            [
                'like'   => 0,
                'unlike' => 1,
            ]
        );
---
insert into `votes` (`question_id`, `user_id`, `like`, `unlike`, `updated_at`, `created_at`) values (2, 1, 1, 0, '2024-02-13 02:37:59', '2024-02-13 02:37:59')
select * from `votes` where `votes`.`user_id` = 1 and `votes`.`user_id` is not null and (`question_id` = 2) limit 1
select * from `votes` where `votes`.`user_id` = 1 and `votes`.`user_id` is not null and (`question_id` = 1) limit 1