app/Http/Controllers/Question/PublishController.php

    public function __invoke(Question $question): RedirectResponse
    {
        $this->authorize('publish', $question);

        $question->update(['draft' => false]);
---
update `questions` set `draft` = 0, `questions`.`updated_at` = '2024-02-13 14:59:14' where `id` = 11